OpenNuvoton/M55M1BSP/SampleCode/StdDriver/USBD_Audio_Codec/usbd_audio.c
/******************************************************************************
 * @file     usbd_audio.c
 * @version  V1.00
 * @brief    USBD audio codec sample file.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

/*!<Includes */
#include <string.h>
#include "NuMicro.h"
#include "usbd_audio.h"

uint32_t volatile g_usbd_SampleRate = AUDIO_RATE;
/*--------------------------------------------------------------------------*/
static volatile uint8_t g_u8PlayVolumeLAdjust = FALSE;
static volatile uint8_t g_u8PlayVolumeRAdjust = FALSE;

/*--------------------------------------------------------------------------*/
/* Global variables for Audio class */
uint32_t g_usbd_UsbAudioState = 0;

static uint8_t  s_u8UsbdRecMute = 0x01;
static int16_t  s_u16UsbdRecVolume = 0x1000;
static int16_t  s_u16UsbdRecMaxVolume = 0x7FFF;
static int16_t  s_u16UsbdRecMinVolume = (int16_t)0x8000;
static int16_t  s_u16UsbdRecResVolume = 0x400;

static uint8_t  s_u8UsbdPlayMute = 0x01;
static int16_t  s_u16UsbdPlayVolumeL = 0x1000;
static int16_t  s_u16UsbdPlayVolumeR = 0x1000;
static int16_t  s_u16UsbdPlayMaxVolume = 0x7FFF;
static int16_t  s_u16UsbdPlayMinVolume = (int16_t)0x8000;
static int16_t  s_u16UsbdPlayResVolume = 0x400;

static uint8_t volatile s_u8PlayEn = 0;
uint8_t volatile g_u8AudioPlaying = 0;
uint8_t volatile g_u8TxDataCntInBuffer = 0;
uint8_t volatile g_u8PDMATxIdx = 0;

static uint8_t volatile s_u8RecEn = 0;
uint8_t volatile g_u8PDMARxIdx = 0;

uint32_t volatile g_u32BuffLen = 0, g_u32RxBuffLen = 0;

/* Player Buffer and its pointer */
#if (NVT_DCACHE_ON == 1)
/* Data buffer is placed in a non-cacheable region */
NVT_NONCACHEABLE uint32_t g_au32PcmPlayBuff[PDMA_TXBUFFER_CNT][BUFF_LEN] __ALIGNED(4) = {0};
NVT_NONCACHEABLE uint8_t g_au8PcmRecBuff[PDMA_RXBUFFER_CNT][BUFF_LEN] __ALIGNED(4) = {0};
#else
uint32_t g_au32PcmPlayBuff[PDMA_TXBUFFER_CNT][BUFF_LEN] __ALIGNED(4) = {0};
uint8_t g_au8PcmRecBuff[PDMA_RXBUFFER_CNT][BUFF_LEN] __ALIGNED(4) = {0};
#endif
uint8_t g_au8PcmRxBufFull[PDMA_RXBUFFER_CNT] __ALIGNED(4) = {0};

static volatile uint32_t s_u32BufPlayIdx = 0;
static volatile uint32_t s_u32PlayBufPos = 0;
static volatile uint32_t s_u32BufRecIdx = 0;


/*--------------------------------------------------------------------------*/
/**
 * @brief       USBD Interrupt Service Routine
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is the USBD ISR
 */
NVT_ITCM void USBD_IRQHandler(void)
{
    uint32_t u32IntSts = USBD_GET_INT_FLAG();
    uint32_t u32State = USBD_GET_BUS_STATE();

    //------------------------------------------------------------------
    if (u32IntSts & USBD_INTSTS_FLDET)
    {
        // Floating detect
        USBD_CLR_INT_FLAG(USBD_INTSTS_FLDET);

        if (USBD_IS_ATTACHED())
        {
            /* USB Plug In */
            USBD_ENABLE_USB();
        }
        else
        {
            /* USB Un-plug */
            USBD_DISABLE_USB();
        }
    }

    //------------------------------------------------------------------
    if (u32IntSts & USBD_INTSTS_WAKEUP)
    {
        /* Clear event flag */
        USBD_CLR_INT_FLAG(USBD_INTSTS_WAKEUP);
    }

    //------------------------------------------------------------------
    if (u32IntSts & USBD_INTSTS_BUS)
    {
        /* Clear event flag */
        USBD_CLR_INT_FLAG(USBD_INTSTS_BUS);

        if (u32State & USBD_STATE_USBRST)
        {
            /* Bus reset */
            USBD_ENABLE_USB();
            USBD_SwReset();
        }

        if (u32State & USBD_STATE_SUSPEND)
        {
            /* Enable USB but disable PHY */
            USBD_DISABLE_PHY();
        }

        if (u32State & USBD_STATE_RESUME)
        {
            /* Enable USB and enable PHY */
            USBD_ENABLE_USB();
        }
    }

    //------------------------------------------------------------------
    if (u32IntSts & USBD_INTSTS_USB)
    {
        // USB event
        if (u32IntSts & USBD_INTSTS_SETUP)
        {
            // Setup packet
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_SETUP);

            /* Clear the data IN/OUT ready flag of control end-points */
            USBD_STOP_TRANSACTION(EP0);
            USBD_STOP_TRANSACTION(EP1);

            USBD_ProcessSetupPacket();
        }

        // EP events
        if (u32IntSts & USBD_INTSTS_EP0)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP0);
            // control IN
            USBD_CtrlIn();
        }

        if (u32IntSts & USBD_INTSTS_EP1)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP1);
            // control OUT
            USBD_CtrlOut();
        }

        if (u32IntSts & USBD_INTSTS_EP2)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP2);
            // Isochronous IN
            EP2_Handler();
        }

        if (u32IntSts & USBD_INTSTS_EP3)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP3);
            // Isochronous OUT
            EP3_Handler();
        }

        if (u32IntSts & USBD_INTSTS_EP4)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP4);
        }

        if (u32IntSts & USBD_INTSTS_EP5)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP5);
        }

        if (u32IntSts & USBD_INTSTS_EP6)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP6);
        }

        if (u32IntSts & USBD_INTSTS_EP7)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP7);
        }

        if (u32IntSts & USBD_INTSTS_EP8)
        {
            /* Clear event flag */
            USBD_CLR_INT_FLAG(USBD_INTSTS_EP8);
        }

